package oop01.Syntax; 
 
 
 /* 멤버변수에 관한 자바 튜토리얼 냉용 
  *  " There are several kinds of variable " 
  *   
  *  클래스안의 멤버변수:  field 
  *  메소드 또는 코드 블락 안에 있는 변수  : 로컬변수 
  *  메소드 선언 안의 변수  : 파라미터 
  *   
  *  변수의 종류 
  *  1. 클래스변수 : 클래스 메모리 로딩 시 가장먼저 생성 
  *  2. 인스터스변수 : 클래스영역, 인스턴스 생성 시 생성 
  *  3. 로컬변수 : 메소드영역안에서, 변수 선언문 수행 시 생성 
  *   
  *  인스턴스변수 
  *  1.  각 인스턴스의 개별적인 저장공간 
  *  2. 인스턴스 생성 후  " 참조변수.인스턴스 변수명"  으로  접근 
  *  3. 인스턴스 생성 시 생성되고, 참조변수가 없을 시 가비지 컬렉터에 의해 자동 제거 
  *   
  *  클래스변수( 클래스변수 = 스태틱 변수) 
  *   
  *  1. 동일 클래스 내부의 인스턴스들이 같은 값으로 공유 
  *  2. 인스턴스 생성 없이  "클래스명 .클래스변수명 "으로 접근 
  *  3. 클래스 로딩 시 생성, 프로그램 종료시 소멸  
  *   
  *   
  *  지역변수  
  *  1. 메소드 내에서 선언, 메소드 종료와 함께 소멸 
  *  2. 조건문, 반복문의 블럭 {} , 내에서 선언된 지역변수는 블럭을 벗어나면 소멸 
  *  3. 반드시 초기화 필요 
  *   
  *  인변 , 클변, 지변 차이 
  *   
  *  인변 : 할당된 값이 가변적 
  *  클변  : 항상 고정 
  *  지변 : 매개값, 초기값 할당후 사용가능 
  *  
  */ 
 
 
 public class No03_VariableSyntax { 
 
 
 } 
